espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/MGM21/Include/mgm21_iadc.h
/* Bit fields for IADC STATUS */
#define _IADC_STATUS_RESETVALUE                         0x00000000UL                                     /**< Default value for IADC_STATUS               */
#define _IADC_STATUS_MASK                               0x4031035BUL                                     /**< Mask for IADC_STATUS                        */
#define IADC_STATUS_SINGLEQEN                           (0x1UL << 0)                                     /**< Single Queue Enabled                        */
#define _IADC_STATUS_SINGLEQEN_SHIFT                    0                                                /**< Shift value for IADC_SINGLEQEN              */
#define _IADC_STATUS_SINGLEQEN_MASK                     0x1UL                                            /**< Bit mask for IADC_SINGLEQEN                 */
#define _IADC_STATUS_SINGLEQEN_DEFAULT                  0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_SINGLEQEN_DEFAULT                   (_IADC_STATUS_SINGLEQEN_DEFAULT << 0)            /**< Shifted mode DEFAULT for IADC_STATUS        */
#define IADC_STATUS_SINGLEQUEUEPENDING                  (0x1UL << 1)                                     /**< Single Queue Pending                        */
#define _IADC_STATUS_SINGLEQUEUEPENDING_SHIFT           1                                                /**< Shift value for IADC_SINGLEQUEUEPENDING     */
#define _IADC_STATUS_SINGLEQUEUEPENDING_MASK            0x2UL                                            /**< Bit mask for IADC_SINGLEQUEUEPENDING        */
#define _IADC_STATUS_SINGLEQUEUEPENDING_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_SINGLEQUEUEPENDING_DEFAULT          (_IADC_STATUS_SINGLEQUEUEPENDING_DEFAULT << 1)   /**< Shifted mode DEFAULT for IADC_STATUS        */
#define IADC_STATUS_SCANQEN                             (0x1UL << 3)                                     /**< Scan Queued Enabled                         */
#define _IADC_STATUS_SCANQEN_SHIFT                      3                                                /**< Shift value for IADC_SCANQEN                */
#define _IADC_STATUS_SCANQEN_MASK                       0x8UL                                            /**< Bit mask for IADC_SCANQEN                   */
#define _IADC_STATUS_SCANQEN_DEFAULT                    0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_SCANQEN_DEFAULT                     (_IADC_STATUS_SCANQEN_DEFAULT << 3)              /**< Shifted mode DEFAULT for IADC_STATUS        */
#define IADC_STATUS_SCANQUEUEPENDING                    (0x1UL << 4)                                     /**< Scan Queue Pending                          */
#define _IADC_STATUS_SCANQUEUEPENDING_SHIFT             4                                                /**< Shift value for IADC_SCANQUEUEPENDING       */
#define _IADC_STATUS_SCANQUEUEPENDING_MASK              0x10UL                                           /**< Bit mask for IADC_SCANQUEUEPENDING          */
#define _IADC_STATUS_SCANQUEUEPENDING_DEFAULT           0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_SCANQUEUEPENDING_DEFAULT            (_IADC_STATUS_SCANQUEUEPENDING_DEFAULT << 4)     /**< Shifted mode DEFAULT for IADC_STATUS        */
#define IADC_STATUS_CONVERTING                          (0x1UL << 6)                                     /**< Converting                                  */
#define _IADC_STATUS_CONVERTING_SHIFT                   6                                                /**< Shift value for IADC_CONVERTING             */
#define _IADC_STATUS_CONVERTING_MASK                    0x40UL                                           /**< Bit mask for IADC_CONVERTING                */
#define _IADC_STATUS_CONVERTING_DEFAULT                 0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_CONVERTING_DEFAULT                  (_IADC_STATUS_CONVERTING_DEFAULT << 6)           /**< Shifted mode DEFAULT for IADC_STATUS        */
#define IADC_STATUS_SINGLEFIFODV                        (0x1UL << 8)                                     /**< SINGLEFIFO Data Valid                       */
#define _IADC_STATUS_SINGLEFIFODV_SHIFT                 8                                                /**< Shift value for IADC_SINGLEFIFODV           */
#define _IADC_STATUS_SINGLEFIFODV_MASK                  0x100UL                                          /**< Bit mask for IADC_SINGLEFIFODV              */
#define _IADC_STATUS_SINGLEFIFODV_DEFAULT               0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_SINGLEFIFODV_DEFAULT                (_IADC_STATUS_SINGLEFIFODV_DEFAULT << 8)         /**< Shifted mode DEFAULT for IADC_STATUS        */
#define IADC_STATUS_SCANFIFODV                          (0x1UL << 9)                                     /**< SCANFIFO Data Valid                         */
#define _IADC_STATUS_SCANFIFODV_SHIFT                   9                                                /**< Shift value for IADC_SCANFIFODV             */
#define _IADC_STATUS_SCANFIFODV_MASK                    0x200UL                                          /**< Bit mask for IADC_SCANFIFODV                */
#define _IADC_STATUS_SCANFIFODV_DEFAULT                 0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_SCANFIFODV_DEFAULT                  (_IADC_STATUS_SCANFIFODV_DEFAULT << 9)           /**< Shifted mode DEFAULT for IADC_STATUS        */
#define IADC_STATUS_TIMERACTIVE                         (0x1UL << 16)                                    /**< Timer Active                                */
#define _IADC_STATUS_TIMERACTIVE_SHIFT                  16                                               /**< Shift value for IADC_TIMERACTIVE            */
#define _IADC_STATUS_TIMERACTIVE_MASK                   0x10000UL                                        /**< Bit mask for IADC_TIMERACTIVE               */
#define _IADC_STATUS_TIMERACTIVE_DEFAULT                0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_TIMERACTIVE_DEFAULT                 (_IADC_STATUS_TIMERACTIVE_DEFAULT << 16)         /**< Shifted mode DEFAULT for IADC_STATUS        */
#define IADC_STATUS_SINGLEWRITEPENDING                  (0x1UL << 20)                                    /**< SINGLE write pending                        */
#define _IADC_STATUS_SINGLEWRITEPENDING_SHIFT           20                                               /**< Shift value for IADC_SINGLEWRITEPENDING     */
#define _IADC_STATUS_SINGLEWRITEPENDING_MASK            0x100000UL                                       /**< Bit mask for IADC_SINGLEWRITEPENDING        */
#define _IADC_STATUS_SINGLEWRITEPENDING_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_SINGLEWRITEPENDING_DEFAULT          (_IADC_STATUS_SINGLEWRITEPENDING_DEFAULT << 20)  /**< Shifted mode DEFAULT for IADC_STATUS        */
#define IADC_STATUS_MASKREQWRITEPENDING                 (0x1UL << 21)                                    /**< MASKREQ write pending                       */
#define _IADC_STATUS_MASKREQWRITEPENDING_SHIFT          21                                               /**< Shift value for IADC_MASKREQWRITEPENDING    */
#define _IADC_STATUS_MASKREQWRITEPENDING_MASK           0x200000UL                                       /**< Bit mask for IADC_MASKREQWRITEPENDING       */
#define _IADC_STATUS_MASKREQWRITEPENDING_DEFAULT        0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_MASKREQWRITEPENDING_DEFAULT         (_IADC_STATUS_MASKREQWRITEPENDING_DEFAULT << 21) /**< Shifted mode DEFAULT for IADC_STATUS        */
#define IADC_STATUS_ADCWARM                             (0x1UL << 30)                                    /**< ADCWARM                                     */
#define _IADC_STATUS_ADCWARM_SHIFT                      30                                               /**< Shift value for IADC_ADCWARM                */
#define _IADC_STATUS_ADCWARM_MASK                       0x40000000UL                                     /**< Bit mask for IADC_ADCWARM                   */
#define _IADC_STATUS_ADCWARM_DEFAULT                    0x00000000UL                                     /**< Mode DEFAULT for IADC_STATUS                */
#define IADC_STATUS_ADCWARM_DEFAULT                     (_IADC_STATUS_ADCWARM_DEFAULT << 30)             /**< Shifted mode DEFAULT for IADC_STATUS        */

/* Bit fields for IADC MASKREQ */
#define _IADC_MASKREQ_RESETVALUE                        0x00000000UL                         /**< Default value for IADC_MASKREQ              */
#define _IADC_MASKREQ_MASK                              0x0000FFFFUL                         /**< Mask for IADC_MASKREQ                       */
#define _IADC_MASKREQ_MASKREQ_SHIFT                     0                                    /**< Shift value for IADC_MASKREQ                */
#define _IADC_MASKREQ_MASKREQ_MASK                      0xFFFFUL                             /**< Bit mask for IADC_MASKREQ                   */
#define _IADC_MASKREQ_MASKREQ_DEFAULT                   0x00000000UL                         /**< Mode DEFAULT for IADC_MASKREQ               */
#define IADC_MASKREQ_MASKREQ_DEFAULT                    (_IADC_MASKREQ_MASKREQ_DEFAULT << 0) /**< Shifted mode DEFAULT for IADC_MASKREQ       */

/* Bit fields for IADC STMASK */
#define _IADC_STMASK_RESETVALUE                         0x00000000UL                       /**< Default value for IADC_STMASK               */
#define _IADC_STMASK_MASK                               0x0000FFFFUL                       /**< Mask for IADC_STMASK                        */
#define _IADC_STMASK_STMASK_SHIFT                       0                                  /**< Shift value for IADC_STMASK                 */
#define _IADC_STMASK_STMASK_MASK                        0xFFFFUL                           /**< Bit mask for IADC_STMASK                    */
#define _IADC_STMASK_STMASK_DEFAULT                     0x00000000UL                       /**< Mode DEFAULT for IADC_STMASK                */
#define IADC_STMASK_STMASK_DEFAULT                      (_IADC_STMASK_STMASK_DEFAULT << 0) /**< Shifted mode DEFAULT for IADC_STMASK        */

/* Bit fields for IADC CMPTHR */
#define _IADC_CMPTHR_RESETVALUE                         0x00000000UL                      /**< Default value for IADC_CMPTHR               */
#define _IADC_CMPTHR_MASK                               0xFFFFFFFFUL                      /**< Mask for IADC_CMPTHR                        */
#define _IADC_CMPTHR_ADLT_SHIFT                         0                                 /**< Shift value for IADC_ADLT                   */
#define _IADC_CMPTHR_ADLT_MASK                          0xFFFFUL                          /**< Bit mask for IADC_ADLT                      */
#define _IADC_CMPTHR_ADLT_DEFAULT                       0x00000000UL                      /**< Mode DEFAULT for IADC_CMPTHR                */
#define IADC_CMPTHR_ADLT_DEFAULT                        (_IADC_CMPTHR_ADLT_DEFAULT << 0)  /**< Shifted mode DEFAULT for IADC_CMPTHR        */
#define _IADC_CMPTHR_ADGT_SHIFT                         16                                /**< Shift value for IADC_ADGT                   */
#define _IADC_CMPTHR_ADGT_MASK                          0xFFFF0000UL                      /**< Bit mask for IADC_ADGT                      */
#define _IADC_CMPTHR_ADGT_DEFAULT                       0x00000000UL                      /**< Mode DEFAULT for IADC_CMPTHR                */
#define IADC_CMPTHR_ADGT_DEFAULT                        (_IADC_CMPTHR_ADGT_DEFAULT << 16) /**< Shifted mode DEFAULT for IADC_CMPTHR        */

/* Bit fields for IADC IF */
#define _IADC_IF_RESETVALUE                             0x00000000UL                            /**< Default value for IADC_IF                   */
#define _IADC_IF_MASK                                   0x800F338FUL                            /**< Mask for IADC_IF                            */
#define IADC_IF_SINGLEFIFODVL                           (0x1UL << 0)                            /**< Single FIFO Data Valid Level                */
#define _IADC_IF_SINGLEFIFODVL_SHIFT                    0                                       /**< Shift value for IADC_SINGLEFIFODVL          */
#define _IADC_IF_SINGLEFIFODVL_MASK                     0x1UL                                   /**< Bit mask for IADC_SINGLEFIFODVL             */
#define _IADC_IF_SINGLEFIFODVL_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for IADC_IF                    */
#define IADC_IF_SINGLEFIFODVL_DEFAULT                   (_IADC_IF_SINGLEFIFODVL_DEFAULT << 0)   /**< Shifted mode DEFAULT for IADC_IF            */
#define IADC_IF_SCANFIFODVL                             (0x1UL << 1)                            /**< Scan FIFO Data Valid Level                  */
#define _IADC_IF_SCANFIFODVL_SHIFT                      1                                       /**< Shift value for IADC_SCANFIFODVL            */
#define _IADC_IF_SCANFIFODVL_MASK                       0x2UL                                   /**< Bit mask for IADC_SCANFIFODVL               */
#define _IADC_IF_SCANFIFODVL_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for IADC_IF                    */
#define IADC_IF_SCANFIFODVL_DEFAULT                     (_IADC_IF_SCANFIFODVL_DEFAULT << 1)     /**< Shifted mode DEFAULT for IADC_IF            */
#define IADC_IF_SINGLECMP                               (0x1UL << 2)                            /**< Single Result Window Compare                */
#define _IADC_IF_SINGLECMP_SHIFT                        2                                       /**< Shift value for IADC_SINGLECMP              */
#define _IADC_IF_SINGLECMP_MASK                         0x4UL                                   /**< Bit mask for IADC_SINGLECMP                 */
#define _IADC_IF_SINGLECMP_DEFAULT                      0x00000000UL                            /**< Mode DEFAULT for IADC_IF                    */
#define IADC_IF_SINGLECMP_DEFAULT                       (_IADC_IF_SINGLECMP_DEFAULT << 2)       /**< Shifted mode DEFAULT for IADC_IF            */
#define IADC_IF_SCANCMP                                 (0x1UL << 3)                            /**< Scan Result Window Compare                  */
#define _IADC_IF_SCANCMP_SHIFT                          3                                       /**< Shift value for IADC_SCANCMP                */
#define _IADC_IF_SCANCMP_MASK                           0x8UL                                   /**< Bit mask for IADC_SCANCMP                   */
#define _IADC_IF_SCANCMP_DEFAULT                        0x00000000UL                            /**< Mode DEFAULT for IADC_IF                    */
#define IADC_IF_SCANCMP_DEFAULT                         (_IADC_IF_SCANCMP_DEFAULT << 3)         /**< Shifted mode DEFAULT for IADC_IF            */
#define IADC_IF_SCANENTRYDONE                           (0x1UL << 7)                            /**< Scan Entry Done                             */
#define _IADC_IF_SCANENTRYDONE_SHIFT                    7                                       /**< Shift value for IADC_SCANENTRYDONE          */
#define _IADC_IF_SCANENTRYDONE_MASK                     0x80UL                                  /**< Bit mask for IADC_SCANENTRYDONE             */
#define _IADC_IF_SCANENTRYDONE_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for IADC_IF                    */
#define IADC_IF_SCANENTRYDONE_DEFAULT                   (_IADC_IF_SCANENTRYDONE_DEFAULT << 7)   /**< Shifted mode DEFAULT for IADC_IF            */
#define IADC_IF_SCANTABLEDONE                           (0x1UL << 8)                            /**< Scan Table Done                             */
#define _IADC_IF_SCANTABLEDONE_SHIFT                    8                                       /**< Shift value for IADC_SCANTABLEDONE          */
#define _IADC_IF_SCANTABLEDONE_MASK                     0x100UL                                 /**< Bit mask for IADC_SCANTABLEDONE             */
#define _IADC_IF_SCANTABLEDONE_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for IADC_IF                    */
#define IADC_IF_SCANTABLEDONE_DEFAULT                   (_IADC_IF_SCANTABLEDONE_DEFAULT << 8)   /**< Shifted mode DEFAULT for IADC_IF            */
#define IADC_IF_SINGLEDONE                              (0x1UL << 9)                            /**< Single Conversion Done                      */
#define _IADC_IF_SINGLEDONE_SHIFT                       9                                       /**< Shift value for IADC_SINGLEDONE             */
#define _IADC_IF_SINGLEDONE_MASK                        0x200UL                                 /**< Bit mask for IADC_SINGLEDONE                */
#define _IADC_IF_SINGLEDONE_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for IADC_IF                    */
#define IADC_IF_SINGLEDONE_DEFAULT                      (_IADC_IF_SINGLEDONE_DEFAULT << 9)      /**< Shifted mode DEFAULT for IADC_IF            */
#define IADC_IF_POLARITYERR                             (0x1UL << 12)                           /**< Polarity Error                              */
#define _IADC_IF_POLARITYERR_SHIFT                      12                                      /**< Shift value for IADC_POLARITYERR            */
#define _IADC_IF_POLARITYERR_MASK                       0x1000UL                                /**< Bit mask for IADC_POLARITYERR               */
#define _IADC_IF_POLARITYERR_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for IADC_IF                    */
#define IADC_IF_POLARITYERR_DEFAULT                     (_IADC_IF_POLARITYERR_DEFAULT << 12)    /**< Shifted mode DEFAULT for IADC_IF            */
#define IADC_IF_PORTALLOCERR                            (0x1UL << 13)                           /**< Port Allocation Error                       */
#define _IADC_IF_PORTALLOCERR_SHIFT                     13                                      /**< Shift value for IADC_PORTALLOCERR           */
#define _IADC_IF_PORTALLOCERR_MASK                      0x2000UL                                /**< Bit mask for IADC_PORTALLOCERR              */
#define _IADC_IF_PORTALLOCERR_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for IADC_IF                    */
#define IADC_IF_PORTALLOCERR_DEFAULT                    (_IADC_IF_PORTALLOCERR_DEFAULT << 13)   /**< Shifted mode DEFAULT for IADC_IF            */
#define IADC_IF_SINGLEFIFOOF                            (0x1UL << 16)                           /**< Single FIFO Overflow                        */
#define _IADC_IF_SINGLEFIFOOF_SHIFT                     16                                      /**< Shift value for IADC_SINGLEFIFOOF           */
#define _IADC_IF_SINGLEFIFOOF_MASK                      0x10000UL                               /**< Bit mask for IADC_SINGLEFIFOOF              */
#define _IADC_IF_SINGLEFIFOOF_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for IADC_IF                    */
#define IADC_IF_SINGLEFIFOOF_DEFAULT                    (_IADC_IF_SINGLEFIFOOF_DEFAULT << 16)   /**< Shifted mode DEFAULT for IADC_IF            */
#define IADC_IF_SCANFIFOOF                              (0x1UL << 17)                           /**< Scan FIFO Overflow                          */
#define _IADC_IF_SCANFIFOOF_SHIFT                       17                                      /**< Shift value for IADC_SCANFIFOOF             */
#define _IADC_IF_SCANFIFOOF_MASK                        0x20000UL                               /**< Bit mask for IADC_SCANFIFOOF                */
#define _IADC_IF_SCANFIFOOF_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for IADC_IF                    */
#define IADC_IF_SCANFIFOOF_DEFAULT                      (_IADC_IF_SCANFIFOOF_DEFAULT << 17)     /**< Shifted mode DEFAULT for IADC_IF            */
#define IADC_IF_SINGLEFIFOUF                            (0x1UL << 18)                           /**< Single FIFO Underflow                       */
#define _IADC_IF_SINGLEFIFOUF_SHIFT                     18                                      /**< Shift value for IADC_SINGLEFIFOUF           */
#define _IADC_IF_SINGLEFIFOUF_MASK                      0x40000UL                               /**< Bit mask for IADC_SINGLEFIFOUF              */
#define _IADC_IF_SINGLEFIFOUF_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for IADC_IF                    */
#define IADC_IF_SINGLEFIFOUF_DEFAULT                    (_IADC_IF_SINGLEFIFOUF_DEFAULT << 18)   /**< Shifted mode DEFAULT for IADC_IF            */
#define IADC_IF_SCANFIFOUF                              (0x1UL << 19)                           /**< Scan FIFO Underflow                         */
#define _IADC_IF_SCANFIFOUF_SHIFT                       19                                      /**< Shift value for IADC_SCANFIFOUF             */
#define _IADC_IF_SCANFIFOUF_MASK                        0x80000UL                               /**< Bit mask for IADC_SCANFIFOUF                */
#define _IADC_IF_SCANFIFOUF_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for IADC_IF                    */
#define IADC_IF_SCANFIFOUF_DEFAULT                      (_IADC_IF_SCANFIFOUF_DEFAULT << 19)     /**< Shifted mode DEFAULT for IADC_IF            */
#define IADC_IF_EM23ABORTERROR                          (0x1UL << 31)                           /**< EM2/3 Abort Error                           */
#define _IADC_IF_EM23ABORTERROR_SHIFT                   31                                      /**< Shift value for IADC_EM23ABORTERROR         */
#define _IADC_IF_EM23ABORTERROR_MASK                    0x80000000UL                            /**< Bit mask for IADC_EM23ABORTERROR            */
#define _IADC_IF_EM23ABORTERROR_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for IADC_IF                    */
#define IADC_IF_EM23ABORTERROR_DEFAULT                  (_IADC_IF_EM23ABORTERROR_DEFAULT << 31) /**< Shifted mode DEFAULT for IADC_IF            */

